{"question_developer": "As a specialised research librarian, I want you to help me generate a better research question for my systematic review. My current question below. Please provide the new systematic review research question after [New Question]: and the rationale behind it after [Rationale]:. Please do not reply with anything other than the new systematic review research question and the rationale.\n My Research Question: ", "intorexp_developer": "As a specialised research librarian, I want you to determine if the research question below best fits a PICO (for a systematic review on an interveniton in a population), PECO (for a systematic review on an exposure in a population), or a SPIDER (for a systematic review on a qualitative research question looking at attitudes or experiences) statement. Please return only the words 'PICO', 'PECO', or 'SPIDER' based on your assessment. Only reply with the strings 'PICO', 'PECO' or 'SPIDER'. Do not provide a rationale for your decision. \n My Research Question: ", "doctitle_developer": "Respond with a document title for a document that summarises a search strategy for the following research question. Please do not reply with anything other than the document title.\n        Research Question: ", "filetitle_developer": "Respond with a maximum 100 character name for a pdf file that summarises a search strategy for the following research question. Please do not reply with anything other than a maximum 100 character file name.\n        Research Question: ", "PICO_developer": "As a specialised research librarian, I want you to generate a PICO statement from the below research question in the format of the below PICO template. Replace the sections in the template contained by [] with your interpretation of what should go there based on the research question. Do not return anything other than the completed PICO Template.\n        PICO Template:\n            Population or Problem: [Who is the group of people being studied?]\n            Intervention: [What is the intevention being investigated? (independent variable))]\n            Comparison: [To what is the intervention being compared?]\n            Outcome: [What are the desired outcomes of the intervention? (dependent variable)] \n        My Research Question: ", "PECO_developer": "As a specialised research librarian, I want you to generate a PECOTR statement from the below research question in the format of the below PECOTR template. Replace the sections in the template contained by [] with your interpretation of what should go there based on the research question. Do not return anything other than the completed PECOTR Template.\n        PECOTR Template:\n            Population or Problem: [How is your population defined? (e.g. age, gender, ethnic group, diagnosis …)]\n            Exposure: [What has your population been deliberately or inadvertently exposed to? Note that this is not a rate, prevalence, simply the exposure. (independent variable)]\n            Comparison: [What are you comparing this with, e.g. a different level of exposure or a different population?]\n            Outcome: [Which result(s) are you focusing on or measuring? What are you hoping to improve?] \n            Timeframe: [What is the duration of the exposure? or What is the follow up schedule? or Is this a longitudinal study?]\n            Results: [Which reported results are you looking for in the literature on your topic?]\n        My Research Question: ", "SPIDER_developer": "As a specialised research librarian, I want you to generate a SPIDER statement from the below research question in the format of the below SPIDER template. Replace the sections in the template contained by [] with your interpretation of what should go there based on the research question. Do not return anything other than the completed SPIDER Template.\n        SPIDER Template:\n            Sample: [The group of participants in qualitative research]\n            Phenomenon of Interest: [The how and why of behaviours and experiences]\n            Design: [How the study was devised and conducted]\n            Evaluation: [The measurement of outcome might be subjective and not necessarily empirical]\n            Research Type: [Qualitative, or quantitative, or mixed?]\n        My Research Question: ", "incexc_developer": "As a specialised research librarian, you need to help a researcher generate inclusion and exclusion criteria for a systematic review based on their study population statement and research question. The population statement and research question are below. Please provide the inclusion and exclusion criteria in the format of Inclusion Criteria: and Exclusion Criteria:. Please do not reply with anything other than the inclusion and exclusion criteria.\n        Population Statement: ", "list_returner": "Return the below string as a python list containing only the words in the string. If you think the words belong together, have them as one item in the list. Please do not reply with anything other than a list of words.\n        String:", "searchstrat_developer": "Act as a specialized research librarian who helps people create search strategies for systematic reviews. The study question, population statement, and inclusion and exclusion criteria below. You will develop a search strategy for searching database based on the research question, population statement, and inclusion and exclusion criteria. You will return only the search strategy and no other text. Please do not reply with anything other than the search strategy.\n        ", "database_developer": "Determine which literature databases  should be searched for a systematic review based on the below research question. You will respond only with a list of appropriate academic databases to search. You will return only the list and no other text or explanation.\n        Research Question: ", "databasesearchstrat_developer": "Act as a specialized research librarian who helps people develop search queries for systematic reviews for specific databases. The search strategy is below. Please do not reply with anything other than a search query for the database that can be entered directly as a search query to the database. Do not list any of the steps required to create the search query.\n        ", "pubmedquery_developer": "Create a pubmed BOOLEAN query based off the below search strategy. Please do not reply with anything other than a BOOLEAN search query that can be input directly into a pubmed search. Your output will be parsed directly into a pubmed search and must not break.\n        Search Strategy: "}